test_cases/hydro_example/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase "$FOAM_CASE";

sourcePatches (patchToExtrudeTo);
exposedPatchName patchToExtrudeFrom;

flipNormals false;
extrudeModel        wedge;

sectorCoeffs
{
    axisPt      (0 0 0);
    axis        (0 1 0);
    angle       3;  // For nLayers=1 assume symmetry so angle/2 on each side
}

mergeFaces false;
mergeTol 1.0e-4;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
