test_cases/hydro_example/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 -0.5511819704 0);

boundaryField
{
    outerDomain
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bubble
    {
        type            fixedValue; //slip;
        value           uniform (0 0 0);
    }
    "wedge_.*"
    {
        type            wedge;
    }

}


// ************************************************************************* //
